[{
		"name": "Logo Design",
		"subtitle": "Logo and branding guidelines for a Chicago non-profit",
		"description": "The Book Benefit is all about new beginnings and possibility. The choice for typography is bold, easy-to-read, and the round letterforms give the logo a whimsical appeal. The playful and diverse colors are meant to represent a wide range of topics and influences that books can have in a child’s life.",
		"img": "TheBookBenefit.png"
	},
	{
		"name": "Logo Design",
		"subtitle": "",
		"description": "The city of West Chicago needed a logo for their economic development initiative — West Chicago Now. This new brand needed to maintain the history of the city, while looking ahead to the future. This was achieved by adding a train in motion and the bold gold as the staple palette to this new initiative’s logo.",
		"img": "WestChicagoNow.jpg"
	},
	{
		"name": "Rebranding",
		"subtitle": "",
		"description": "Adelante Hispanic Achievers wanted a rebrand in honor of their tenth anniversary of serving the hispanic youth community. The brand needed to reflect the students, as well as to appeal to potential investors. The custom graphic represents the ladders of success and the four tenants  as well as pays homage to their historic roots by mimicking South American architecture.",
		"img": "AdelanteLogo.png"
	},
	{
		"name": "Branding",
		"subtitle": "",
		"description": "Warp Zone Louisville is a physical space designated as a game creators co-working space in downtown Louisville. The logo needed to be modern and exciting to reflect the industry of the organization and studios that use the space.",
		"img": "WZ-sign-mockup.jpg"
	},

	{
		"name": "Rebranding",
		"subtitle": "",
		"description": "A decision was made to update the name from LubriSyn to LubriSynHA to better reflect that the product contains hyaluronic acid, a term that has been growing in consumer knowledge as being beneficial to joints. The yellow and blue colorways were kept from the original brand identity, but they were updated to be richer and a darker blue was added to round out the color system. New brochures were designed for the equine and pet markets, with a consistent design across both products. Flyers, handouts, POS displays, advertisements and all other marketing and sales support materials were designed to support the rebrand.",
		"img": "LubriSynBrochure.png"
	},
	{
		"name": "Rebranding",
		"subtitle": "",
		"description": "Two Scoop Games needed a new logo in time for a big event where they would be showcasing a game they have in development. The main criteria was something bright and fun, while retaining the ice cream cone shape. They also needed a design that would look great on stickers and other promotional materials, as well as web. A new logo, and bold, fun new brand colors were developed.",
		"img": "TwoScoop-banner.png"
	},
	{
		"name": "Collateral development",
		"subtitle": "",
		"description": "Louisville Makes Games is a non-profit organization geared at supporting the game development community in Louisville. The collateral created needed to serve as a take-away for members of the broader community to understand what the organization does. ",
		"img": "LMG-postcard.jpg"
	},
	{
		"name": "Brochure design",
		"subtitle": "",
		"description": "Music for All is a national organization that provides world-class programs and advocates for arts education. Throughout the year, several program brochures are needed for their events, all with their own unique look and feel. Books range in size from 8-120+ pages. ",
		"img": "MFA-NationalFestivalApp.jpg"
	},
	{
		"name": "Display design",
		"subtitle": "",
		"description": "DiVentures is a growing retail chain of dive shops in the midwest. Collateral is developed with a consistent brand across all materials – from in-store and out of house banners, to promotional flyers and advertisements and everything in between.",
		"img": "DiVentures-banner-stand.jpg"
	}
]
